## mesazon-clusters-configure-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gateway_pg_configure.data.digitalocean_database_cluster.postgres_cluster: Reading...
module.gateway_pg_configure.data.digitalocean_database_cluster.postgres_cluster: Read complete after 1s [id=ca5a53b1-c9cf-4404-a8a2-94a39ccfe7c4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gateway_pg_configure.digitalocean_database_user.database_user will be created
  + resource "digitalocean_database_user" "database_user" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      + cluster_id  = "ca5a53b1-c9cf-4404-a8a2-94a39ccfe7c4"
      + id          = (known after apply)
      + name        = "gateway_user_fra1_dev"
      + password    = (sensitive value)
      + role        = (known after apply)
    }

  # module.gateway_pg_configure.digitalocean_database_user.flyway_user will be created
  + resource "digitalocean_database_user" "flyway_user" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      + cluster_id  = "ca5a53b1-c9cf-4404-a8a2-94a39ccfe7c4"
      + id          = (known after apply)
      + name        = "gateway_flyway_user_fra1_dev"
      + password    = (sensitive value)
      + role        = (known after apply)
    }

  # module.gateway_pg_configure.postgresql_default_privileges.flyway_sequences_to_user will be created
  + resource "postgresql_default_privileges" "flyway_sequences_to_user" {
      + database          = "defaultdb"
      + id                = (known after apply)
      + object_type       = "sequence"
      + owner             = "gateway_flyway_user_fra1_dev"
      + privileges        = [
          + "USAGE",
        ]
      + role              = "gateway_group_fra1_dev"
      + schema            = "gateway_schema_fra1_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_default_privileges.flyway_tables_to_user will be created
  + resource "postgresql_default_privileges" "flyway_tables_to_user" {
      + database          = "defaultdb"
      + id                = (known after apply)
      + object_type       = "table"
      + owner             = "gateway_flyway_user_fra1_dev"
      + privileges        = [
          + "DELETE",
          + "INSERT",
          + "SELECT",
          + "UPDATE",
        ]
      + role              = "gateway_group_fra1_dev"
      + schema            = "gateway_schema_fra1_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_provided_schema_usage will be created
  + resource "postgresql_grant" "flyway_provided_schema_usage" {
      + database          = "defaultdb"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "CREATE",
          + "USAGE",
        ]
      + role              = "gateway_flyway_group_fra1_dev"
      + schema            = "gateway_schema_fra1_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_public_schema_usage will be created
  + resource "postgresql_grant" "flyway_public_schema_usage" {
      + database          = "defaultdb"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "CREATE",
          + "USAGE",
        ]
      + role              = "gateway_flyway_group_fra1_dev"
      + schema            = "public"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.user_provided_schema_usage will be created
  + resource "postgresql_grant" "user_provided_schema_usage" {
      + database          = "defaultdb"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "USAGE",
        ]
      + role              = "gateway_group_fra1_dev"
      + schema            = "gateway_schema_fra1_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant_role.flyway_assignment will be created
  + resource "postgresql_grant_role" "flyway_assignment" {
      + grant_role        = "gateway_flyway_group_fra1_dev"
      + id                = (known after apply)
      + role              = "gateway_flyway_user_fra1_dev"
      + with_admin_option = false
    }

  # module.gateway_pg_configure.postgresql_grant_role.user_assignment will be created
  + resource "postgresql_grant_role" "user_assignment" {
      + grant_role        = "gateway_group_fra1_dev"
      + id                = (known after apply)
      + role              = "gateway_user_fra1_dev"
      + with_admin_option = false
    }

  # module.gateway_pg_configure.postgresql_role.flyway_group will be created
  + resource "postgresql_role" "flyway_group" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = false
      + name                      = "gateway_flyway_group_fra1_dev"
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

  # module.gateway_pg_configure.postgresql_role.user_group will be created
  + resource "postgresql_role" "user_group" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = false
      + name                      = "gateway_group_fra1_dev"
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

  # module.gateway_pg_configure.postgresql_schema.database_schema will be created
  + resource "postgresql_schema" "database_schema" {
      + database      = (known after apply)
      + drop_cascade  = false
      + id            = (known after apply)
      + if_not_exists = true
      + name          = "gateway_schema_fra1_dev"
      + owner         = "gateway_group_fra1_dev"

      + policy (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>